project_planning/index.org
#+STARTUP: indent
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
#+TITLE:     Projects
#+AUTHOR:    John Brestelli
#+DESCRIPTION: DataDev Projects
#+OPTIONS:   H:5 num:nil p:t tags:not-in-toc
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="https://jbrestel.github.io/org-docs/css/index.css" />
* Data Loading, preprocessing and workflows
** Genomics Workflow
*** BLOCKED UniDB                                                                                              :JohnB:
[[readtheorgs:/project_planning/unidb.html][html]] | [[orgdocs:/project_planning/unidb.org][org]] | [[https://redmine.apidb.org/projects/jbdqh][redmine]]
*** THEM JBrowse Migration                                                                                     :JohnI:
[[readtheorgs:/SOPs/jbrowseFlatFileMigration.html][html]] | [[orgdocs:/SOPs/jbrowseFlatFileMigration.org][org]]
- [ ] QA Test new files
*** QA DNASeq Workflow (nextflow)                                                               :KathrynC:JohnB:
[[readtheorgs:/project_planning/dnaseq.html][html]] | [[orgdocs:/project_planning/dnaseq.org][org]] | [[https://redmine.apidb.org/projects/p30029][redmine]]
- [ ] YMAP (mark/kathryn/david)
- [ ] [[redmine:42258]] reflow workflow / database
- [ ] [[redmine:32649]] and [[redmine:42259]] variation front end
- [ ] [[redmine:32307]] user workspace / exporters
*** THEM Long Read RNASeq                                                                                   :KathrynC:
- [ ] [[redmine:32125]]
*** Misc Data Loading
 [[readtheorgs:/project_planning/dataLoad.html][html]] | [[orgdocs:/project_planning/dataLoad.org][org]]
**** TODO ESTs                                                                                                 :JayH:
**** TODO GPIAnchor and MitoProt                                                                              :JohnB:
**** DONE Intron Junctions                                                                             :BrianB:JohnI:
** EDA
*** IN_PROGRESS EDA DataLoad                                                                      :JayH:JohnB:WojtekB:
[[readtheorgs:/project_planning/eda.html][html]] | [[orgdocs:/project_planning/eda.org][org]]
**** IN_PROGRESS MapVEu and Mbio (Mega Study)                                                                 :JohnB:
**** IN_PROGRESS DIY                                                                             :WojtekB:JayH:JohnB:
 [[readtheorgs:/project_planning/eda_diy.html][html]] | [[orgdocs:/project_planning/eda_diy.org][org]]
**** THEM MicrobiomeDB Reflow Workflow                                                                       :Wojtek:
- [X] dataset record and eda study needs to be associated
- [X] tuning job to make dataset presenter table and "StudyDataset" Table
**** THEM Collections                                                                                   :Wojtek:JayH:
** Microbiome
*** DONE Eukaryotic Detection                                                                                :WojtekB:
* Front End Applications
** WDK
*** Genomics
**** BLOCKED UniDB Performance and App Specific Databases                                         :JohnB:MarkH:JohnI:
[[readtheorgs:/project_planning/appDb.html][html]] | [[orgdocs:/project_planning/appDb.org][org]]
**** Network Analysis and Host Pathogen                                                                        :AnnB:
[[readtheorgs:/project_planning/networkAnalysis.html][html]] | [[orgdocs:/project_planning/networkAnalysis.org][org]]
**** Gene Lists                                                                       :HaimingW:OmarH:CristinaA:AnnB:
[[readtheorgs:/project_planning/geneLists.html][html]] | [[orgdocs:/project_planning/geneLists.org][org]]
**** Dataset and Project Record                                                                                :AnnB:
[[readtheorgs:/project_planning/dataset.html][html]] | [[orgdocs:/project_planning/dataset.org][org]]
**** THEM Organism Preferences                                                                               :BinduG:
[[redmine:47221]]
**** THEM Selenium Tests                                                                                      :RichD:
[[readtheorgs:/project_planning/selenium.html][html]] | [[orgdocs:/project_planning/selenium.org][org]]
**** THEM Download File Record                                                                               :BinduG:
*** OrthoMCL
**** BLOCKED Phylogenetic Pattern WS improve performance                                                      :MarkH:
- [ ] limit to reference organisms on OrthoMCL Site
  - [ ] component sites show all strains
  - [ ] some mechanism to hide organisms from orthomcl?
- [ ] tree in ortho to use ncbi taxonomy
**** BLOCKED Additional content (keywords) on genomics gene pages
- [ ] [[redmine:24852]]

** EDA
*** THEM Dataviz Foothills                                                                                 :DanielleC:
[[https://www.notion.so/dataviz-foothills-27d25be09e5740b7a279385fa9e0d390][notion]]
*** THEM MicrobiomeDB                                                                                   :WojtekB:AnnB:
- [X] Remove Sample WDK Records (need a new branch of MbioModel?)
  - [X] comment sample records in MicrobiomeModel/Model/lib/wdk/microbiomeModel.xml
- [X] first release no compute service
-
** THEM MapVEu                                                                                                   :BobM:
 [[https://redmine.apidb.org/projects/maprefad/issues?set_filter=0][redmine]]
** Genome Browser
 [[https://redmine.apidb.org/projects/p110][redmine]]
*** THEM Apollo                                                                                                :PaulW:
[[readtheorgs:/project_planning/apollo.html][html]] | [[orgdocs:/project_planning/apollo.org][org]]
** Galaxy / Globus                                                                                              :OmarH:
 [[https://onedrive.live.com/edit.aspx?resid=A33886B8E9920EF7!8142&ithint=file%2cxlsx&authkey=!AEhTv4bcB6N8NZs][onedrive]] :MarkH:
- [ ] strand specific UD error
** Site Search
*** DONE EDA Site Search for ClinEpi                                                             :JohnI:YikunD:SteveF:
** Documentation
*** SOPs for Existing Datatypes
- [ ] RNASeq  [[readtheorgs:/SOPs/rnaseq.html][html]] | [[orgdocs:/SOPs/rnaseq.org][org]]
- [ ] Microarray
- [ ] Phenotype
- [ ] Chip Chip
- [ ] Chip Seq
*** How to change Database Schema
- [ ] Alter Table
- [ ] New Table
